{"keras_version": "2.2.4", "config": {"layers": [{"config": {"trainable": true, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false, "input_length": 4, "embeddings_regularizer": null, "batch_input_shape": [null, 4], "output_dim": 128, "activity_regularizer": null, "embeddings_constraint": null, "input_dim": 10918, "name": "embedding_3", "dtype": "float32"}, "class_name": "Embedding"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_5", "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "strides": [1], "kernel_size": [3], "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "conv1d_3", "data_format": "channels_last", "padding": "valid", "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"data_format": "channels_last", "name": "global_max_pooling1d_3", "trainable": true}, "class_name": "GlobalMaxPooling1D"}, {"config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_5", "bias_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_6", "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 319, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_6", "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_3"}, "backend": "tensorflow", "class_name": "Sequential"}